In [1]:
import pandas as pd
import numpy as np
from sympy.logic.algorithms.lra_theory import UnhandledInput

In [2]:
from common.libs.data_analysis.SeriesDescriber import *
from common.libs.data_analysis.SeriesDescriberWRTTarget import *
from common.libs.DataDisplayer import *

In [11]:
oil_df = pd.read_csv("inputs/transformed/oil.csv", delimiter=",")
holiday_events_df = pd.read_csv("inputs/transformed/holidays_events.csv", delimiter=",")
stores_df = pd.read_csv("inputs/transformed/stores.csv", delimiter=",").set_index("store_nbr")
transactions_df = pd.read_csv("inputs/transformed/transactions.csv", delimiter=",")
train_df = pd.read_csv("inputs/transformed/train.csv", delimiter=",").set_index("id")

### Data Analysis

In [12]:
def df_info(df):
    display_side_by_side(df.describe(), df.head())
    df.info(verbose=1, show_counts=True)

In [13]:
df_info(oil_df)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1704 non-null   object
 1   dcoilwtico  1704 non-null   float64
dtypes: float64(1), object(1)
memory usage: 26.8+ KB

In [14]:
df_info(holiday_events_df)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 338 entries, 0 to 337
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   338 non-null    int64
 1   date         338 non-null    object
 2   type         338 non-null    object
 3   locale       338 non-null    object
 4   locale_name  338 non-null    object
dtypes: int64(1), object(4)
memory usage: 13.3+ KB

In [28]:
describe_categorical_series(holiday_events_df["type"])

,type
count,338
unique,5
top,Holiday
freq,221
,count
type,
Holiday,221
Event,56
Additional,51
Bridge,5
Work Day,5

In [27]:
locale_name = "Ecuador"
display_side_by_side(
        stores_df[stores_df["city"] == locale_name].head(),
        stores_df[stores_df["state"] == locale_name].head(),
)

# Regional : state

,city,state,type,cluster
store_nbr,,,,
,city,state,type,cluster
store_nbr,,,,

In [26]:
holiday_events_df[holiday_events_df["locale"] == "National"].head()

    Unnamed: 0        date        type    locale locale_name
14          14  2012-08-10     Holiday  National     Ecuador
19          19  2012-10-09     Holiday  National     Ecuador
20          21  2012-11-02     Holiday  National     Ecuador
21          22  2012-11-03     Holiday  National     Ecuador
30          31  2012-12-21  Additional  National     Ecuador

In [16]:
df_info(holiday_events_df)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 338 entries, 0 to 337
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   338 non-null    int64
 1   date         338 non-null    object
 2   type         338 non-null    object
 3   locale       338 non-null    object
 4   locale_name  338 non-null    object
dtypes: int64(1), object(4)
memory usage: 13.3+ KB

In [17]:
df_info(stores_df)

<class 'pandas.core.frame.DataFrame'>
Index: 54 entries, 1 to 54
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   city     54 non-null     object
 1   state    54 non-null     object
 2   type     54 non-null     object
 3   cluster  54 non-null     int64
dtypes: int64(1), object(3)
memory usage: 2.1+ KB

In [18]:
df_info(transactions_df)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [19]:
df_info(train_df)

<class 'pandas.core.frame.DataFrame'>
Index: 3000888 entries, 0 to 3000887
Data columns (total 5 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   date         3000888 non-null  object
 1   store_nbr    3000888 non-null  int64
 2   family       3000888 non-null  object
 3   sales        3000888 non-null  float64
 4   onpromotion  3000888 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 137.4+ MB

In [20]:
describe_categorical_series(train_df["store_nbr"])

,store_nbr
count,3000888
unique,54
top,1
freq,55572
,count
store_nbr,
1,55572
10,55572
11,55572
12,55572
13,55572
14,55572
15,55572
16,55572
17,55572
18,55572
19,55572
2,55572
20,55572
21,55572
22,55572
23,55572
24,55572
25,55572
26,55572
27,55572
28,55572
29,55572
3,55572
30,55572
31,55572
32,55572
33,55572
34,55572
35,55572
36,55572
37,55572
38,55572
39,55572
4,55572
40,55572
41,55572
42,55572
43,55572
44,55572
45,55572
46,55572
47,55572
48,55572
49,55572
5,55572
50,55572
51,55572
52,55572
53,55572
54,55572
6,55572
7,55572
8,55572
9,55572